const Cn = {
	common:{
		noDapp:'请在dapp浏览器中访问',
		noConnect:'您需要在連接前切換到',
		noData:'暂无数据',
		balance:'余额',
		success:'成功',
		fail:'失败',
		all:'全部',
		cancel:'取消',
		confirm:'确认',
		submit:'提交',
		service:'手续费',
		quantity:'数量',
		time:'时间',
		price:'价格',
		record:'记录',
		connectWallet:'连接钱包',
		copy:'复制',
		receive:'领取',
		history:'历史记录',
		nodata:'暂无数据',
		yes:'是',
		no:'否',
		tips:'提示',
		close:'关闭',
		day: '天',
		details: '详情',
		over: '已结束',
		max: '最大',
		address: '地址',
		pledge: '质押',
		redeem: '赎回',
		underway: '进行中',
		recommend: '推荐',
		restriction: '限购',
		about: '关于',
		extract: '提取',
		link: '链接',
		mylink: '我的链接',
		myRank: '我的等级',
		earnings: '收益',
		currency: '币种',
		name: '名称',
		latestPrice: '最新价',
		priceLimit: '涨跌幅',
		cInterest: '复利'
	},
	tips:{
		tip1:'余额不足',
		tip2:'请输入数量',
		tip3:'用户拒绝事务签名',
		tip4:'请输入地址',
		tip5:'请选择答案',
		tip6:'请输入正确的地址',
		tip7:'已售完',
		tip8:'请输入推荐人地址',
		tip9:'交易平台暂未开放',
		tip10:'功能待开发',
		tip11:'请选择答案',
		tip12:'无可领取DAM',
		tip13:'是否提取本金?',
		tip14:'不可交换',
		tip15:'已被质押,不可赠送和升级',
		tip16:'请输入绑定地址',
		tip17:'已经绑定了地址',
		tip18:'输入值不低于',
		noopen:'暂未开放',
	},
	
	nav: {
		n1: '绑定地址',
		n2: '质押挖矿',
		my: '我的',
		index: '首页',
		bank: 'AI算力',
		market: '行情',
		mine: '我的',
		MyPledge: '我的质押',
		MyInvitation: '我的邀请',
		hashGame: '哈希游戏',
		helpCenter: '帮助中心',
		game: '游戏',
		myIncome: '我的收益',
		myTeam: '我的团队'
	},
	
	build: {
		b1: '总地址数量',
		b2: '被绑定地址'
	},
	
	index: {
		h1: '去中心化',
		h2: '数字资产增值',
		h3: '服务平台',
		i1: 'AI数字资产银行',
		i2: '数字资产理财服务平台',
		i3: '为用户提供专业、安全的数字资产理财、管理服务，确保用户数字资产的安全和增值。',
		i4: '未来发展',
		i5: '数字资产理财服务平台专注数字资产交易和理财服务',
		i6: '打造社交活动与游戏参与体验通过社交活动产生被动收入',
		i7: '打造元宇宙商城，完成一站式全链路消费生态孵化，促进生活消费品质升级',
		i8: '迪赛盈（DSE）金融科技公司是一家以区块链技术服务为依托，专注于区块链领域的技术研发、应用和服务、具有全球未来视野的数字资产管理公司，要业务涵盖了算力资产购买与交易、'
		   +'流动性挖矿、加密资产组合投资等数字资产管理服务。旨在建立安全，便捷，全面的数字资产流动及增值渠道，完善开放的中心化数字交易的生态体系，实现数字资产的财富未来。' 
	},
	
	bank: {
		b1: 'AI赋能数字资产',
		b2: `低风险,高年化率<br/>周期灵活选择`,
		b3: '储存复利',
		b4: '最低收益时间',
		b5: '最大年利率',
		b6: '最大周期收益率',
		b7: '已赚取',
		b8: '历史赚取',
		b9: '预计收益',
		b10: '周期收益率',
		b11: '年利率',
		b12: '解锁日期',
		b13: '日收益率',
		b14: '个人累计储存收益',
		b15: '储存',
		b16: '周期选择'
	},
	
	mine: {
		m1: '我的储存',
		m2: '储存金额',
		m3: '累计收益',
		m4: '我的邀请',
		m5: '全网绑定地址数',
		m6: '历史总业绩'
	},
	
	earnings: {
		e1: '邀请总收益',
		e2: '直推收益',
		e3: '间推收益',
		e4: '团队收益',
		e5: '待领取收益',
		e6: '领取收益',
		e7: '总收益',
		e8: '平级收益'
	},
	
	pledge:{
		p1:"当前储存",
		p2:"历史储存",
		p3:"储存时间",
		p4:"提取时间",
		p5:'定期时间',
		p6:"本期进度",
		p7:"解锁日期",
		p8:"总资产",
		p9:"已领取",
		p10:"待领取",
		p11: "提取收益",
		p12: "一键复投",
		p13: "投入本金为",
		p14: '储存资产',
		p15: '储存收益',
	},
	
	
	invite: {
		i1: "我的上级",
		i2: "直推人数",
		i3: "间推人数",
		i4: "收益记录",
		i5: "提取邀请收益",
		i6: "团队总人数",
		i7: "团队业绩",
	},
	
	
	detail: {
		d1: '直推地址数',
		d2: '直推总收益',
		d3: '团队质押数量',
		d4: '直推数据',
		d5: '限购'
	},
	
	
	card: {
		c1: '质押金额',
		c2: '质押时间',
		c3: '近期提取时间',
		c4: '质押周期',
		c5: '质押日化率',
		c6: '待领取',
		c7: '已领取',
		
		c8: '质押数量',
		c9: '直推收益',
		
		c10: '提取收益',
		c11: '已产收益',
		
		c12: '限购数量',
		c13: '收益周期',
		c14: '质押日化率',
		c15: '推荐奖励',
		c16: '撤回质押'
		
	},
	
	
	other: {
		o1: '绑定关系',
		o2: '预估手续费',
		o3: '当前余额',
		o4: '请输入要质押的Rabbit数量',
		o5: '请输入要质押的LP数量',
		o6: '请输入不低于1000的Rabbit',
		o7: '请输入不低于0的LP',
		o8: '还未到赎回时间',
		o9: '输入值不低于2',
		o10: '提取值需大于2'
	}
	
}

export default Cn