const Fn = {

	common: {
		noDapp: '請在dapp瀏覽器中訪問',
		noConnect: '您需要在連接前切換到',
		noData: '暫無數據',
		balance: '餘額',
		success: '成功',
		fail: '失敗',
		all: '全部',
		cancel: '取消',
		confirm: '確認',
		submit: '提交',
		service: '手續費',
		quantity: '數量',
		time: '時間',
		price: '價格',
		record: '記錄',
		connectWallet: '連接錢包',
		copy: '複製',
		receive: '領取',
		history: '歷史記錄',
		nodata: '暫無數據',
		yes: '是',
		no: '否',
		tips: '提示',
		close: '關閉',
		day: '天',
		details: '詳情',
		over: '已結束',
		max: '最大',
		address: '地址',
		pledge: '質押',
		redeem: '贖回',
		underway: '進行中',
		recommend: '推薦',
		restriction: '限購',
		about: '關於',
		extract: '選取',
		link: '連結',
		mylink: '我的連結',
		myRank: '我的等級',
		earnings: '收益',
		currency: '幣種',
		name: '名稱',
		latestPrice: '最新價',
		priceLimit: '漲跌幅',
		cInterest: '複利'
	},

	tips: {
		tip1: '餘額不足',
		tip2: '請輸入數量',
		tip3: '用戶拒絕事務簽名',
		tip4: '請輸入地址',
		tip5: '請選擇答案',
		tip6: '請輸入正確的地址',
		tip7: '已售完',
		tip8: '請輸入推薦人地址',
		tip9: '交易平臺暫未開放',
		tip10: '功能待開發',
		tip11: '請選擇答案',
		tip12: '無可領取DAM',
		tip13: '是否選取本金？',
		tip14: '不可交換',
		tip15: '已被質押,不可贈送和陞級',
		tip16: '請輸入綁定地址',
		tip17: '已經綁定了地址',
		tip18: '輸入值不低於',
		noopen: '暫未開放',
	},

	nav: {
		n1: '綁定地址',
		n2: '質押挖礦',
		my: '我的',
		index: '首頁',
		bank: 'AI算力',
		market: '行情',
		mine: '我的',
		MyPledge: '我的質押',
		MyInvitation: '我的邀請',
		hashGame: '雜湊遊戲',
		helpCenter: '幫助中心',
		game: '遊戲',
		myIncome: '我的收益',
		myTeam: '我的團隊'
	},

	build: {
		b1: '總地址數量',
		b2: '被綁定地址'
	},



	index: {
		h1: '去中心化',
		h2: '數位資產增值',
		h3: '服務平臺',
		i1: '數位資產銀行',
		i2: '數位資產理財服務平臺',
		i3: '為用戶提供專業、安全的數位資產理財、管理服務,確保用戶數位資產的安全和增值。',
		i4: '未來發展',
		i5: '數位資產理財服務平臺專注數位資產交易和理財服務',
		i6: '打造社交活動與遊戲參與體驗通過社交活動產生被動收入',
		i7: '打造元宇宙商城,完成一站式全連結消費生態孵化,促進生活消費品質陞級',
		i8: '迪賽盈（DSE）金融科技公司是一家以區塊鏈技術服務為依託,專注於區塊鏈領域的技術研發、應用和服務、具有全球未來視野的數位資產管理公司,要業務涵蓋了算力資產購買與交易、' +
			'流動性挖礦、加密資產組合投資等數位資產管理服務。 旨在建立安全,便捷,全面的數位資產流動及增值通路,完善開放的中心化數位交易的生態體系,實現數位資產的財富未來。'
	},



	bank: {
		b1: 'AI賦能數字資產',
		b2: '低風險，高年化率<br/>週期灵活選擇',
		b3: '儲存複利',
		b4: '最低收益時間',
		b5: '最大年利率',
		b6: '最大週期收益率',
		b7: '已賺取',
		b8: '歷史賺取',
		b9: '預計收益',
		b10: '週期收益率',
		b11: '年利率',
		b12: '解鎖日期',
		b13: '日收益率',
		b14: '個人累計儲存收益',
		b15: '儲存',
		b16: '週期選擇'
	},

	mine: {
		m1: '我的儲存',
		m2: '儲存金額',
		m3: '累計收益',
		m4: '我的邀請',
		m5: '全網綁定地址數',
		m6: '歷史總業績'
	},



	earnings: {
		e1: '邀請總收益',
		e2: '直推收益',
		e3: '間推收益',
		e4: '團隊收益',
		e5: '待領取收益',
		e6: '領取收益',
		e7: '總收益',
		e8: '平級收益'
	},



	pledge: {

		p1: '正在儲存',
		p2: '歷史儲存',
		p3: '儲存時間',
		p4: '選取時間',
		p5: '定期時間',
		p6: '本期進度',
		p7: '解鎖日期',
		p8: '總资产',
		p9: '已領取',
		p10: '待領取',
		p11: '選取收益',
		p12: '一鍵複投',
		p13: '投入本金為',
		p14: '儲存资产',
		p15: '儲存收益',
	},

	invite: {
		i1: '我的上級',
		i2: '直推人數',
		i3: '間推人數',
		i4: '收益記錄',
		i5: "提取邀請收益",
		i6: "團隊總人數",
		i7: "團隊業績",
	},


	other: {
		o1: '綁定關係',
		o2: '預估手續費',
		o3: '當前餘額',
		o4: '請輸入要質押的Rabbit數量',
		o5: '請輸入要質押的LP數量',
		o6: '請輸入不低於1000的Rabbit',
		o7: '請輸入不低於0的LP',
		o8: '還未到贖回時間',
		o9: '輸入值不低於2',
		o10: '提取值需大於2'
	}

}
export default Fn